dic = {'А': 'ка', 'И': 'ки', 'Р': 'ши', 'Ш': 'ли', 'Б': 'зу', 'Й': 'фу', 'С': 'ари', 'Щ': 'ни',
       'В': 'ру', 'К': 'ме', 'Т': 'чи', 'a': 'д', 'Г': 'джи', 'Л': 'та', 'У': 'мей', 'Ы': 'хе',
       'Д': 'те', 'М': 'рин', 'Ф': 'лу', 'Ь': 'ксе', 'Е': 'ку', 'Ё': 'ку', 'Н': 'то', 'Х': 'ри',
       'Э': 'га', 'Ж': 'зу', 'О': 'мо', 'Ц': 'ми', 'Ю': 'до', 'З': 'з',
       'П': 'но', 'Ч': 'зи', 'Я': 'ма', ' ': ' '}

name = input()
japanese_name = []
for i in name:
    for x in (dic[i.upper()]):
        japanese_name.append(x)
print(japanese_name[0].upper(), ''.join(japanese_name[1:]), sep='')